Repository: Yassir-Zbida/MIC-Plugin
Catalog: languages/mic-woo-sync-*.po
Languages: fr_fr

source: Settings saved successfully!
fr_fr: Paramètres sauvegardés avec succès !

source: MIC Woo to App Sync
fr_fr: Synchronisation App Made in China

source: MIC Sync
fr_fr: Sync MIC

source: Settings
fr_fr: Paramètres

source: Sync Logs
fr_fr: Journaux de synchronisation

source: Analytics
fr_fr: Analyses

source: Configured
fr_fr: Configuré

source: Needs Configuration
fr_fr: Nécessite une configuration

source: Sync WooCommerce orders with your Laravel ebook application
fr_fr: Synchroniser les commandes WooCommerce avec votre application eBooks Laravel

source: Laravel App URL
fr_fr: URL de l'application Laravel

source: The base URL of your Laravel application (without /api/v1/woocommerce-sync)
fr_fr: L'URL de base de votre application Laravel (sans /api/v1/woocommerce-sync)

source: Webhook Secret
fr_fr: Secret du Webhook

source: The secret key configured in your Laravel app's .env file
fr_fr: La clé secrète configurée dans le fichier .env de votre application Laravel

source: Sync on Order Status
fr_fr: Synchroniser selon le statut de commande

source: Select which order statuses should trigger sync
fr_fr: Sélectionnez quels statuts de commande doivent déclencher la synchronisation

source: Save Settings
fr_fr: Sauvegarder les paramètres

source: Connection Test
fr_fr: Test de connexion

source: Test the connection to your Laravel application. This will verify that your Laravel app is accessible and can receive requests from WooCommerce.
fr_fr: Tester la connexion à votre application Laravel. Cela vérifiera que votre application Laravel est accessible et peut recevoir des requêtes de WooCommerce.

source: If the test fails but orders are still syncing successfully, the issue might be with the test endpoint or CORS settings. The actual sync functionality may work fine.
fr_fr: Si le test échoue mais que les commandes se synchronisent toujours avec succès, le problème pourrait être avec le point de terminaison de test ou les paramètres CORS. La fonctionnalité de synchronisation réelle peut fonctionner correctement.

source: Basic Connectivity Test
fr_fr: Test de connectivité de base

source: Full Connection Test
fr_fr: Test de connexion complet

source: Troubleshooting Tips:
fr_fr: Conseils de dépannage :

source: Ensure your Laravel app is running and accessible from your WordPress server
fr_fr: Assurez-vous que votre application Laravel fonctionne et est accessible depuis votre serveur WordPress

source: Check that the route /api/v1/woocommerce-sync exists in your Laravel app
fr_fr: Vérifiez que la route /api/v1/woocommerce-sync existe dans votre application Laravel

source: Verify CORS settings allow requests from your WordPress domain
fr_fr: Vérifiez que les paramètres CORS permettent les requêtes depuis votre domaine WordPress

source: Check Laravel logs for any errors when the test request is made
fr_fr: Vérifiez les journaux Laravel pour toute erreur lors de la requête de test

source: Setup Guide
fr_fr: Guide de configuration

source: Configure Laravel App
fr_fr: Configurer l'application Laravel

source: In your Laravel app's
fr_fr: Dans le fichier de votre application Laravel

source: file, add:
fr_fr: , ajoutez :

source: Run Migrations
fr_fr: Exécuter les migrations

source: In your Laravel app, run:
fr_fr: Dans votre application Laravel, exécutez :

source: Create Route
fr_fr: Créer la route

source: Ensure your Laravel app has the sync endpoint:
fr_fr: Assurez-vous que votre application Laravel a le point de terminaison de synchronisation :

source: Product SKUs
fr_fr: SKU des produits

source: Make sure your WooCommerce products have SKUs that match your Laravel ebook identifiers.
fr_fr: Assurez-vous que vos produits WooCommerce ont des SKU qui correspondent aux identifiants de votre ebook Laravel.

source: Testing...
fr_fr: Test en cours...

source: Testing connection...
fr_fr: Test de connexion en cours...

source: Connection successful! Laravel app is responding.
fr_fr: Connexion réussie ! L'application Laravel répond.

source: Connection failed:
fr_fr: Connexion échouée :

source: Connection error:
fr_fr: Erreur de connexion :

source: Unknown error
fr_fr: Erreur inconnue

source: Test Connection
fr_fr: Tester la connexion

source: Laravel URL not configured. Please enter your Laravel app URL in the settings above.
fr_fr: URL Laravel non configurée. Veuillez entrer l'URL de votre application Laravel dans les paramètres ci-dessus.

source: Webhook secret not configured. Please enter your webhook secret in the settings above.
fr_fr: Secret du webhook non configuré. Veuillez entrer votre secret de webhook dans les paramètres ci-dessus.

source: Debug Info:
fr_fr: Informations de débogage :

source: Laravel URL:
fr_fr: URL Laravel :

source: WordPress Site URL:
fr_fr: URL du site WordPress :

source: Connection test from WooCommerce plugin
fr_fr: Test de connexion depuis le plugin WooCommerce

source: Connection test completed successfully
fr_fr: Test de connexion terminé avec succès

source: Connection test failed
fr_fr: Test de connexion échoué

source: Unauthorized
fr_fr: Non autorisé

source: Please check your webhook secret configuration.
fr_fr: Veuillez vérifier la configuration de votre secret webhook.

source: Endpoint not found
fr_fr: Point de terminaison non trouvé

source: Please verify the sync endpoint exists in your Laravel app.
fr_fr: Veuillez vérifier que le point de terminaison de synchronisation existe dans votre application Laravel.

source: Unexpected response
fr_fr: Réponse inattendue

source: Basic connectivity test completed successfully
fr_fr: Test de connectivité de base terminé avec succès

source: Basic connectivity test failed:
fr_fr: Test de connectivité de base échoué :

source: Laravel URL not configured
fr_fr: URL Laravel non configurée

source: Basic connectivity test failed - HTTP
fr_fr: Test de connectivité de base échoué - HTTP

source: MIC App Sync Status
fr_fr: Statut de synchronisation App MIC

source: Order Successfully Synced
fr_fr: Commande synchronisée avec succès

source: This order has been synchronized with your Laravel application.
fr_fr: Cette commande a été synchronisée avec votre application Laravel.

source: Order Not Synced
fr_fr: Commande non synchronisée

source: This order has not been synchronized with your Laravel application yet.
fr_fr: Cette commande n'a pas encore été synchronisée avec votre application Laravel.

source: Plugin Not Configured
fr_fr: Plugin non configuré

source: Please configure the plugin settings to enable sync functionality.
fr_fr: Veuillez configurer les paramètres du plugin pour activer la fonctionnalité de synchronisation.

source: Configure Plugin
fr_fr: Configurer le plugin

source: Sync Order Now
fr_fr: Synchroniser la commande maintenant

source: Resync Order
fr_fr: Resynchroniser la commande

source: Current Status
fr_fr: Statut actuel

source: Status:
fr_fr: Statut :

source: Successfully Synced
fr_fr: Synchronisé avec succès

source: Last Sync Time:
fr_fr: Dernière heure de synchronisation :

source: Total Attempts:
fr_fr: Total des tentatives :

source: Not Synced
fr_fr: Non synchronisé

source: Last Error:
fr_fr: Dernière erreur :

source: Last sync: %s
fr_fr: Dernière synchronisation : %s

source: Order Information
fr_fr: Informations de la commande

source: Customer:
fr_fr: Client :

source: Products
fr_fr: Produits

source: No SKU
fr_fr: Aucun SKU

source: Qty:
fr_fr: Qté :

source: No products found in this order.
fr_fr: Aucun produit trouvé dans cette commande.

source: Sync History
fr_fr: Historique de synchronisation

source: Duration: %s seconds
fr_fr: Durée : %s secondes

source: Are you sure you want to manually sync this order to the Laravel app?
fr_fr: Êtes-vous sûr de vouloir synchroniser manuellement cette commande avec l'application Laravel ?

source: Will sync
fr_fr: Va synchroniser

source: Won't sync
fr_fr: Ne synchronisera pas

source: ⚠️ This product has no SKU and will not sync with the Made in China Laravel app. Do you want to continue anyway?
fr_fr: ⚠️ Ce produit n'a pas de SKU et ne se synchronisera pas avec l'application Laravel Made in China.\n\nVoulez-vous continuer quand même ?

source: Synced
fr_fr: Synchronisé

source: Sync Now
fr_fr: Synchroniser maintenant

source: Order not found
fr_fr: Commande non trouvée

source: Plugin not configured. Please configure Laravel URL and webhook secret.
fr_fr: Plugin non configuré. Veuillez configurer l'URL Laravel et le secret du webhook.

source: Order sync successful!
fr_fr: Synchronisation de commande réussie !

source: Order sync failed. Check the logs for details.
fr_fr: Synchronisation de commande échouée. Vérifiez les journaux pour plus de détails.

source: Order sync retry successful!
fr_fr: Nouvelle tentative de synchronisation de commande réussie !

source: Order sync retry failed. Check the logs for details.
fr_fr: Nouvelle tentative de synchronisation de commande échouée. Vérifiez les journaux pour plus de détails.

source: Plugin not configured
fr_fr: Plugin non configuré

source: Sync completed successfully
fr_fr: Synchronisation terminée avec succès

source: No products with SKUs found
fr_fr: Aucun produit avec SKU trouvé

source: Track all synchronization attempts and their status
fr_fr: Suivre toutes les tentatives de synchronisation et leur statut

source: No sync logs found.
fr_fr: Aucun journal de synchronisation trouvé.

source: Filter by status:
fr_fr: Filtrer par statut :

source: All Status
fr_fr: Tous les statuts

source: Success
fr_fr: Succès

source: Failed
fr_fr: Échec

source: Pending
fr_fr: En attente

source: Filter
fr_fr: Filtrer

source: Clear
fr_fr: Effacer

source: Clear Logs
fr_fr: Effacer les journaux

source: Order ID
fr_fr: ID de commande

source: Customer
fr_fr: Client

source: Response
fr_fr: Réponse

source: Time
fr_fr: Heure

source: Duration
fr_fr: Durée

source: View Order
fr_fr: Voir la commande

source: product(s)
fr_fr: produit(s)

source: No products
fr_fr: Aucun produit

source: Retry
fr_fr: Réessayer

source: Enter number of days to keep logs (0 = clear all logs, 30 = keep last 30 days):
fr_fr: Entrez le nombre de jours pour conserver les journaux (0 = effacer tous les journaux, 30 = conserver les 30 derniers jours) :

source: Please enter a valid number (0 or higher)
fr_fr: Veuillez entrer un nombre valide (0 ou plus)

source: Are you sure you want to clear ALL sync logs? This cannot be undone.
fr_fr: Êtes-vous sûr de vouloir effacer TOUS les journaux de synchronisation ? Cela ne peut pas être annulé.

source: Are you sure you want to clear logs older than %d days? This cannot be undone.
fr_fr: Êtes-vous sûr de vouloir effacer les journaux datant de plus de %d jours ? Cela ne peut pas être annulé.

source: Error:
fr_fr: Erreur :

source: Error clearing logs:
fr_fr: Erreur lors de l'effacement des journaux :

source: Previous
fr_fr: Précédent

source: Next
fr_fr: Suivant

source: Analytics Dashboard
fr_fr: Tableau de bord des analyses

source: Comprehensive sync performance and statistics overview
fr_fr: Aperçu complet des performances et statistiques de synchronisation

source: Synchronization Statistics and Performance Metrics
fr_fr: Statistiques de synchronisation et métriques de performance

source: View Logs
fr_fr: Voir les journaux

source: TOTAL SYNCS
fr_fr: TOTAL DES SYNCHRONISATIONS

source: All time synchronization attempts
fr_fr: Tentatives de synchronisation de tous les temps

source: All Time
fr_fr: Tous les temps

source: SUCCESSFUL
fr_fr: RÉUSSIES

source: Orders synced successfully
fr_fr: Commandes synchronisées avec succès

source: Active
fr_fr: Actif

source: FAILED
fr_fr: ÉCHOUÉES

source: Synchronization failures
fr_fr: Échecs de synchronisation

source: Issue
fr_fr: Problème

source: SUCCESS RATE
fr_fr: TAUX DE RÉUSSITE

source: Overall sync reliability
fr_fr: Fiabilité globale de synchronisation

source: Needs Attention
fr_fr: Nécessite une attention

source: PENDING
fr_fr: EN ATTENTE

source: Awaiting synchronization
fr_fr: En attente de synchronisation

source: Waiting
fr_fr: En attente

source: RECENT ACTIVITY
fr_fr: ACTIVITÉ RÉCENTE

source: Syncs in the last week
fr_fr: Synchronisations de la semaine dernière

source: 7 Days
fr_fr: 7 jours

source: Daily Activity Table (Last 7 Days)
fr_fr: Tableau d'activité quotidienne (7 derniers jours)

source: Detailed breakdown of synchronization activity by day
fr_fr: Détail de l'activité de synchronisation par jour

source: Success Rate
fr_fr: Taux de réussite

source: No Data Available
fr_fr: Aucune donnée disponible

source: Start by processing some orders to see sync statistics
fr_fr: Commencez par traiter quelques commandes pour voir les statistiques de synchronisation

source: Sync to App
fr_fr: Synchroniser vers l'App

source: Sync Status
fr_fr: Statut de synchronisation

source: MIC Woo to App Sync:
fr_fr: Synchronisation App Made in China :

source: This plugin requires WooCommerce to be installed and activated.
fr_fr: Ce plugin nécessite que WooCommerce soit installé et activé.

source: MIC Woo to App Sync plugin is active.
fr_fr: Le plugin de synchronisation App Made in China est actif.

source: WooCommerce version:
fr_fr: Version WooCommerce :

source: Unknown
fr_fr: Inconnue

source: HPOS enabled:
fr_fr: HPOS activé :

source: Yes
fr_fr: Oui

source: No
fr_fr: Non

source: Resync
fr_fr: Resynchroniser

source: Available Actions
fr_fr: Actions disponibles

source: Update the order information in your Laravel app.
fr_fr: Mettre à jour les informations de la commande dans votre application Laravel.

source: Manually sync this order to your Laravel application.
fr_fr: Synchroniser manuellement cette commande avec votre application Laravel.

source: Please configure the plugin settings to enable manual sync.
fr_fr: Veuillez configurer les paramètres du plugin pour activer la synchronisation manuelle.

source: Order Sync Failed
fr_fr: Échec de synchronisation de commande

source: Previous sync attempts have failed. You can retry the synchronization.
fr_fr: Les tentatives de synchronisation précédentes ont échoué. Vous pouvez réessayer la synchronisation.

source: Retry Sync
fr_fr: Réessayer la synchronisation

source: Are you sure you want to retry syncing this order?
fr_fr: Êtes-vous sûr de vouloir réessayer la synchronisation de cette commande ?

source: Retrying...
fr_fr: Nouvelle tentative...

source: Retry failed:
fr_fr: Nouvelle tentative échouée :

source: ✅ Connection test completed successfully! Your Laravel app is properly configured and responding.
fr_fr: ✅ Test de connexion terminé avec succès ! Votre application Laravel est correctement configurée et répond.

source: ❌ Authentication failed (HTTP 401). The webhook signature verification failed.
fr_fr: ❌ Échec de l'authentification (HTTP 401). La vérification de la signature du webhook a échoué.

source: 💡 However, since your order sync is working, this might be a test-specific issue. Your actual sync functionality should work fine.
fr_fr: 💡 Cependant, puisque votre synchronisation de commandes fonctionne, cela pourrait être un problème spécifique au test. Votre fonctionnalité de synchronisation réelle devrait fonctionner correctement.

source: Possible causes:
fr_fr: Causes possibles :

source: Test endpoint expects different authentication than sync endpoint
fr_fr: Le point de terminaison de test attend une authentification différente du point de terminaison de synchronisation

source: CORS settings blocking test requests
fr_fr: Paramètres CORS bloquant les requêtes de test

source: Laravel route middleware differences
fr_fr: Différences dans le middleware des routes Laravel

source: ❌ Endpoint not found (HTTP 404). Please check that the route exists in your Laravel app.
fr_fr: ❌ Point de terminaison non trouvé (HTTP 404). Veuillez vérifier que la route existe dans votre application Laravel.

source: ❌ Unexpected response
fr_fr: ❌ Réponse inattendue

source: Security check failed
fr_fr: Échec de la vérification de sécurité

source: Cleared %d log entries
fr_fr: %d entrées de journal effacées

source: Failed to clear logs
fr_fr: Échec de l'effacement des journaux

source: Connection test completed successfully! Your Laravel app received and processed the test order data correctly.
fr_fr: Test de connexion terminé avec succès ! Votre application Laravel a reçu et traité les données de commande de test correctement.

source: Test data sent:
fr_fr: Données de test envoyées :

source: Domain:
fr_fr: Domaine :

source: Site name:
fr_fr: Nom du site :

source: Test order ID:
fr_fr: ID de commande de test :

source: Incorrect webhook secret key
fr_fr: Clé secrète webhook incorrecte

source: Signature verification method mismatch
fr_fr: Incompatibilité de méthode de vérification de signature

source: CORS settings blocking requests
fr_fr: Paramètres CORS bloquant les requêtes

source: ❌ Validation error (HTTP 422): Your Laravel app rejected the test data.
fr_fr: ❌ Erreur de validation (HTTP 422) : Votre application Laravel a rejeté les données de test.

source: This usually means your Laravel validation rules are different from what the plugin is sending.
fr_fr: Cela signifie généralement que vos règles de validation Laravel sont différentes de ce que le plugin envoie.

source: Raw response:
fr_fr: Réponse brute :

source: Security check failed. Please try again.
fr_fr: Échec de la vérification de sécurité. Veuillez réessayer.
